app/Controllers/ControladorFEPeriodo.php

SELECT *
FROM `tbl_periodo`
ORDER BY `PER_ANO` DESC
---
    public function filtroEstadisticoGradoPeriodo($tipo)
    {

        try {
            //modelo
            $obgPeriodo = new ModelFEPeriodo();
            //periodos
            //$data['tbl_periodo'] = $obgPeriodo->findAll();

            //periodos ordenados en orden descendente en base al año
            $data['tbl_periodo'] = $obgPeriodo->orderBy('PER_ANO', 'DESC')->findAll();