app/Controllers/ControladorFECarrera.php

SELECT *
FROM `tbl_carrera`
WHERE `CTIP_ID` = 2
AND `CAR_CARRERA` = 1
SELECT *
FROM `tbl_escuela`
---
    public function filtroEstadisticoGradoCarrera($tipo)
    {
        try {
            //modelo
            $objEstadMatr = new ModelFEcarreras();
            $objPadre = new ModelFEpadre();

            //car_nombre donde ctip = 2, car_carrera = 1
            $data['tbl_carrera'] = $objEstadMatr
                ->where('CTIP_ID', 2)
                ->where('CAR_CARRERA', 1)
                ->findAll();

            $padre['tbl_escuela'] = $objPadre->findAll();

SELECT *
FROM `tbl_estadistica_matriz`
WHERE `ESTM_CARRERA` = '15'
SELECT *
FROM `tbl_carrera`
---
    public function reporteGradoCarreraGeneral($id)
    {
        try {
            //modelo
            $objEstadMatr = new ModelMatrizGraduados();
            //carrera
            $objCarrera = new ModelFEcarreras();
            //tbl_estadistica_matriz tiene ESTM_CARRERA comparar con $id
            $data['tbl_estadistica_matriz'] = $objEstadMatr->where('ESTM_CARRERA', $id)->findAll();
            $carreras['tbl_carrera'] = $objCarrera->findAll();

SELECT *
FROM `tbl_carrera`
WHERE `CTIP_ID` = 1
AND `CAR_CARRERA` = 1
SELECT *
FROM `tbl_escuela`
---
    public function filtroEstadisticoPosgradoCarrera($tipo)
    {
        try {
            //modelo
            $objEstadMatr = new ModelFEcarreras();
            $objPadre = new ModelFEpadre();

            //car_nombre donde ctip = 1, car_carrera = 1
            $data['tbl_carrera'] = $objEstadMatr
                ->where('CTIP_ID', 1)
                ->where('CAR_CARRERA', 1)
                ->findAll();

            $padre['tbl_escuela'] = $objPadre->findAll();

SELECT *
FROM `tbl_carrera`
---
    public function reportePosgradoCarreraMatriculados($id)
    {
        try {
            //modelo
            $objEstadMatr = new ModelMatrizGraduados();
            //carrera
            $objCarrera = new ModelFEcarreras();
            //tbl_estadistica_matriz tiene ESTM_CARRERA comparar con $id
            $data['tbl_estadistica_matriz'] = $objEstadMatr->where('ESTM_CARRERA', $id)->findAll();
            $carreras['tbl_carrera'] = $objCarrera->findAll();