app/Controllers/ControladorFEEscuela.php

SELECT *
FROM `tbl_carrera`
WHERE `CTIP_ID` = 2
AND `CAR_ESCUELA` = 1
---
    public function filtroEstadisticoGradoEscuela($tipo)
    {
        try {
            //modelo
            $objEscuela = new ModelFEescuelas();
            //escuelas
            $data['tbl_carrera'] = $objEscuela->where('CTIP_ID', 2)->where('CAR_ESCUELA', 1)->findAll();