app/Controllers/ControladorFECarrera.php

SELECT *
FROM `tbl_carrera`
WHERE `CTIP_ID` = 1
AND `CAR_CARRERA` = 1
---
    public function filtroEstadisticoPosgradoCarrera($tipo)
    {
        try {
            //modelo
            $objCarreras = new ModelFEcarreras();
            $objPadre = new ModelFEpadre();
            //car_nombre donde ctip = 1, car_carrera = 1
            $data['tbl_carrera'] = $objCarreras
                ->where('CTIP_ID', 1)
                ->where('CAR_CARRERA', 1)
                ->findAll();