app/Controllers/ControladorFEPeriodo.php

SELECT *
FROM `tbl_periodo`
WHERE `PER_ANO` >= 2021
ORDER BY `PER_ANO` DESC
---
    public function filtroEstadisticoPosGradoPeriodo($tipo)
    {
        try {
            //modelo
            $obgPeriodo = new ModelFEPeriodo();
            //periodos ordenados en orden descendente en base al año 1997
            $data['tbl_periodo'] = $obgPeriodo->where('PER_ANO >=', 1997)->orderBy('PER_ANO', 'DESC')->findAll();