app/Controllers/ControllerSelector.php

    public function selectorReporteCarreraTecnologiaMatriculados($ids){
        try {
            // Convertir la cadena de IDs en un array
            $id_array = explode(',', $ids);

            // Modelo
            $objCarrera = new ModelFEcarreras();
            $objEstadMatr = new ModelMatrizGraduados();

            // Obtener carreras basadas en los IDs seleccionados
            $data['tbl_carrera'] = $objCarrera->whereIn('CAR_ID', $id_array)->findAll();

            //datos estad
            $data['tbl_estadistica_matriz'] = $objEstadMatr->findAll();
---
SELECT *
FROM `tbl_carrera`
WHERE `CAR_ID` IN ('129','128')
SELECT *
FROM `tbl_estadistica_matriz`