app/Models/ModelFEPeriodo.php

    public function verModelo(){
        $periodos = $this->findAll();
---
SELECT *
FROM `tbl_periodo`

    public function contarPeriodosPosgrados(){
        //contar desde 1997 fecha posgrados
        $periodos = $this->where('PER_ANO >=', 1997)->findAll();
---
SELECT *
FROM `tbl_periodo`
WHERE `PER_ANO` >= 1997

    public function obtenerId($nombre){
        $periodo = $this->where('PER_PERIODO', $nombre)->first();
---
SELECT *
FROM `tbl_periodo`
WHERE `PER_PERIODO` = 'Septiembre 2021 - ENERO 2022'
 LIMIT 1