app/Models/ModelFEcarreras.php

    public function contarCarrerasGrado()
    {
        /* contar CAR_CARRERA = 1 (grado) CTIP_ID = 2 (GRADO) */
        $carreras = $this->where('CTIP_ID', 2)->where('CAR_CARRERA', 1)->findAll();
---
SELECT *
FROM `tbl_carrera`
WHERE `CTIP_ID` = 2
AND `CAR_CARRERA` = 1