app/Models/ModelMatrizGraduados.php

SELECT *
FROM `tbl_periodo`
WHERE `PER_ANO` >= '2023'
AND `PER_ANO` <= '2023'
---
    public function verModeloEspecifico($fechaIncio, $fechaFin)
    {
        //obtener año de las fechasç
        $anioInicio = substr($fechaIncio, 0, 4);
        $anioFin = substr($fechaFin, 0, 4);
        //crear campo hidden para luego leer en el controlador
        $data = [
            'fechaInicio' => $fechaIncio,
            'fechaFin' => $fechaFin,
        ];

        //TODO periodo tiene PER_ID, PER_ANO, se compara con la fecha de inicio y fin y se extrae el PER_ID
        //TODO matrizEstadist busca donde coincide ese PER_ID con ESTM_PERIODO y se busca

        //modelo periodos
        $modeloPeriodo = new ModelFEPeriodo();
        //ver data
        $periodo = $modeloPeriodo->where('PER_ANO >=', $anioInicio)->where('PER_ANO <=', $anioFin)->findAll();