app/Models/ModelFEcarreras.php

    public function verModelo()
    {
        $carreras = $this->findAll();
---
SELECT *
FROM `tbl_carrera`

    public function contarCarrerasGrado()
    {
        /* contar CAR_CARRERA = 1 (grado) CTIP_ID = 2 (GRADO) */
        $carreras = $this->where('CTIP_ID', 2)->where('CAR_CARRERA', 1)->findAll();
---
SELECT *
FROM `tbl_carrera`
WHERE `CTIP_ID` = 1
AND `CAR_CARRERA` = 1

    public function obtenerId($nombre)
    {
        $carrera = $this->where('CAR_NOMBRE', $nombre)->first();
---
SELECT *
FROM `tbl_carrera`
WHERE `CAR_NOMBRE` = 'TECNOLOGÍA SUPERIOR EN ADMINISTRACIÓN DE LAS ORGANIZACIONES DE LA ECONOMÍA POPULAR Y SOLIDARIA'
 LIMIT 1