app/Models/ModelCarreraTipo.php

SELECT *
FROM `tbl_carrera_tipo`
---
    public function verModelo()
    {
        $carreraTipo = $this->findAll();

SELECT *
FROM `tbl_carrera_tipo`
WHERE `CTIP_NOMBRE` = 'Posgrado'
 LIMIT 1
---
    public function obtenerId($nombre)
    {
        $carreraTipo = $this->where('CTIP_NOMBRE', $nombre)->first();